Task 4.9 Part 1

In [2]:
# importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# importing the new file

# path to the folder 
path = r'/Users/emilsafarov/Library/CloudStorage/OneDrive-Personal/CF/A4_Python/Instacart Basket Analysis/02 Data'

# importing the 'customers' file
customers = pd.read_csv(os.path.join(path, 'Original data', 'customers.csv'))

In [4]:
# checking the imported file
customers.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# checking the dimensions of the imported data frame

customers.shape

(206209, 10)

In [6]:
# checking descriptive statistics for numerical data (integers)
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
# checking data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [8]:
# Wrangling data

In [9]:
# Establishing uniformity

# for the first name
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

# for surname
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

# for state
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

# for Gender
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

# for Age
customers.rename(columns = {'Age' : 'age'}, inplace = True)

# for joining date
customers.rename(columns = {'date_joined' : 'joining_date'}, inplace = True)

# for the number of dependents
customers.rename(columns = {'n_dependants' : 'quantity_of_dependants'}, inplace = True)

# for the marital status
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

# for the amount of income
customers.rename(columns = {'income' : 'annual_income'}, inplace = True)

In [10]:
# Rechecking the df 

customers.head(5)

,user_id,first_name,last_name,gender,state,age,joining_date,quantity_of_dependants,marital_status,annual_income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In my understanding there is no point to eliminate any column

In [12]:
# Perform essential data quality checks, such as handling missing values, removing duplicates, and standardizing mixed-type data for consistency.

In [13]:
customers.dtypes

user_id                    int64
first_name                object
last_name                 object
gender                    object
state                     object
age                        int64
joining_date              object
quantity_of_dependants     int64
marital_status            object
annual_income              int64
dtype: object

In [14]:
#changing user_id type for 'int' to 'string'

customers['user_id'] = customers['user_id'].astype(str)

In [15]:
# rechecking the results
customers.dtypes

user_id                   object
first_name                object
last_name                 object
gender                    object
state                     object
age                        int64
joining_date              object
quantity_of_dependants     int64
marital_status            object
annual_income              int64
dtype: object

In [16]:
# checking for mixed data type in each column
for col in customers.columns:
    if customers[col].map(type).nunique() > 1:
        print(f"Column '{col}' has mixed data types.")

Column 'first_name' has mixed data types.

In [17]:
# uniforming data types into str in 'first_name' column

customers['first_name'] = customers['first_name'].astype(str)

In [18]:
# rechecking for a mixed data type in each column
for col in customers.columns:
    if customers[col].map(type).nunique() > 1:
        print(f"Column '{col}' has mixed data types.")

now the data types in all columns are uniformed

In [20]:
null_columns = customers.columns[customers.isnull().any()]
print(f"Columns with null values: {list(null_columns)}")

Columns with null values: []

In [21]:
duplicates = customers.duplicated()
if duplicates.any():
    print(f"Number of duplicate rows: {duplicates.sum()}")
else:
    print("No duplicate rows found.")

No duplicate rows found.

In [22]:
customers.describe()

                 age  quantity_of_dependants  annual_income
count  206209.000000           206209.000000  206209.000000
mean       49.501646                1.499823   94632.852548
std        18.480962                1.118433   42473.786988
min        18.000000                0.000000   25903.000000
25%        33.000000                0.000000   59874.000000
50%        49.000000                1.000000   93547.000000
75%        66.000000                3.000000  124244.000000
max        81.000000                3.000000  593901.000000

Everything looks fine and within the norms.

In [24]:
# importing the rest of the prepared Instacart data

# path to the folder 
path = r'/Users/emilsafarov/Library/CloudStorage/OneDrive-Personal/CF/A4_Python/Instacart Basket Analysis/02 Data'

# importing the 'customers' file, which was output of task 4.8
ords_prods = pd.read_pickle(os.path.join(path, 'Prepared data', 'ords_prods_merged_output_4_8.pkl'))

In [25]:
# checking the shape of imported df
ords_prods.shape

(32404859, 23)

In [26]:
# checking imported df
ords_prods.head(5)

,Unnamed: 0_x,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,aisle_id,department_id,prices,max-order,max_order,loyalty_flag,avg_spending,spending_flag,order_frequency,frequency_flag
0,0,2539329,1,1,2,8,NaN,196,1,0,...,77,7,9.0,10,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,0,2539329,1,1,2,8,NaN,14084,2,0,...,91,16,12.5,10,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,0,2539329,1,1,2,8,NaN,12427,3,0,...,23,19,4.4,10,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,0,2539329,1,1,2,8,NaN,26088,4,0,...,23,19,4.7,10,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,0,2539329,1,1,2,8,NaN,26405,5,0,...,54,17,1.0,10,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [27]:
# conbining 2 data frames using 'user_id' as a key 

#checking dtype in "ords_prods" df

ords_prods['user_id'].dtype

dtype('int64')

In [28]:
# converting dtype from integer to str
ords_prods['user_id']=ords_prods['user_id'].astype('str')

In [29]:
# rechecking the result
ords_prods['user_id'].dtype

dtype('O')

In [30]:
customers['user_id'].dtype

dtype('O')

In [31]:
# merging 2 df based on key id = 'used_id' 
merged_df = pd.merge(ords_prods, customers, on = 'user_id', how = 'inner')

In [32]:
merged_df.head(5)

,Unnamed: 0_x,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,frequency_flag,first_name,last_name,gender,state,age,joining_date,quantity_of_dependants,marital_status,annual_income
0,0,2539329,1,1,2,8,NaN,196,1,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,0,2539329,1,1,2,8,NaN,14084,2,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,0,2539329,1,1,2,8,NaN,12427,3,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,0,2539329,1,1,2,8,NaN,26088,4,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,0,2539329,1,1,2,8,NaN,26405,5,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [33]:
merged_df.shape

(32404859, 32)

In [34]:
merged_df.dtypes

Unnamed: 0_x                 int64
order_id                     int64
user_id                     object
order_number                 int64
order_day_of_week            int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
Unnamed: 0_y                 int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
max-order                    int64
max_order                    int64
loyalty_flag                object
avg_spending               float64
spending_flag               object
order_frequency            float64
frequency_flag              object
first_name                  object
last_name                   object
gender                      object
state                       object
age                          int64
joining_date                object
quantity_of_dependants       int64
marital_status              object
annual_income                int64
dtype: object

In [35]:
merged_df['order_id'] = merged_df['order_id'].astype('str')

In [36]:
merged_df.dtypes

Unnamed: 0_x                 int64
order_id                    object
user_id                     object
order_number                 int64
order_day_of_week            int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
_merge                    category
Unnamed: 0_y                 int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
max-order                    int64
max_order                    int64
loyalty_flag                object
avg_spending               float64
spending_flag               object
order_frequency            float64
frequency_flag              object
first_name                  object
last_name                   object
gender                      object
state                       object
age                          int64
joining_date                object
quantity_of_dependants       int64
marital_status              object
annual_income                int64
dtype: object

In [ ]:
merged_df.value_counts()

In [ ]:
# Export the DataFrame as a pickle file
merged_df.to_pickle(os.path.join(path, 'Prepared data', 'merged_df_output_4_9.pkl'))